#**Ray Quiz**

*1)*	What’s Ray’s problem? Why is he so unhappy?

Ray’s unhappy because he lives in conflict with his ___________. He feels disconnected from his Higher Self. 

a. Friends

b. Beliefs

c. True self

d. Doctor

*2*)	How does Ray’s childish image of Sun [God] compare to Doc’s understanding?

To Ray the sun is a stranger, far away. Ray exists a part from the Sun. But to Doc, Ray is apart of the Sun.  

*3*)	True or False: (What is it about Ray’s Sun that he doesn’t like?)

The Sun is controlling, overbearing and robs Ray of the freedom to be himself.

a. True 

b. False 

*4*)	How does Ray’s understanding of service differ from Doc’s?

Draggy list: 

*   Service to Ray is    *   disempowering and self-effacing.
*   Service to Doc is    *   empowering and self-asserting.

*5*)	True or False: (What does Doc mean when he says that the Sun is “our shared Greater Self?)

We are all rays of the Sun. He is the Soul of our soul. We exist as a part of Him; not apart from Him.

*6*)	According to Doc how does the Sun become present on earth? The brilliance, warmth and vitality of the Sun is channeled into the world through...

a.  
 
b. Us; His rays. 

c. 

d. 

*7*)	Why according to Doc does the Sun love us with the same love He loves himself?

Because there is really nothing but the Sun. The Sun is us even though we are not the Sun; He is much greater than us all.

*8*)	Draggy: 

* What does it mean to be Holy according to Ray? * To give up myself and sacrifice the joy of living his life however he pleases.

* What does it mean to be Holy according to Doc? * To be, in the truest sense, completely our-selves; fully actualized.

*9*)	According to Doc, rays of light are more wholly [completely] themselves when they are in service of the Sun. Why?

True or False: Because we are simply being who we are. All the Sun really asks of us is to be ourselves.

A:True

*10*)	Why would Ray be happier if he lived life in service of the Sun?

The secrets to happiness is to feel unconditional self-worth; to know that we eternally matter. Apart from the Sun we are nothing; here today, gone tomorrow. But as a part of the Sun we tap into the greatest sense of ultimate self.
 
*11*)	 True or False: 

Ray has to give up what he wants and do what the Sun wants. Service is oppression not self-expression. 

A:False

*12*)	Doc’s tells Ray, “It’s only your beliefs and lifestyle that set you apart from Him in your mind.”  Please explain.

Ray is connected to the Sun no matter what. And if he truly believed that fact he would think, speak and act in ways that joyfully affirm that truth.

*13*)	According to Doc, Ray’s choice is to portray or betray himself. Please explain. 
We are not punished for our sins but by our sins. To do the will of the Sun is to live up to our Higher Self. If we were in touch with our real self we would naturally want to live the will of the Sun.

*14*)	What’s the difference between ‘Fake it till you make it’ and ‘Fake it till you awake it’?

Draggy list:

* ‘Fake it till you make it’   * means I’m trying to force myself to become something I’m really not. I will always be faking it.
* ‘Fake it till you awake it’  * means I’m revealing who I already am. 

*15*)	 Why would making the unconscious conscious lead to spiritual health and ever greater happiness? 

Because there will no longer be a conflict between who I really am and how I am living my life.

*16*)	 Doc tells Ray, “Your connection can never be broken but it can be denied”? Please explain.

Our connection to the Sun is an existential fact and will never change. And yet we may be oblivious to that truth.

*17*)	 According to Doc what is causing Ray all his stress and sadness?

Basing his self-worth on self-delusions.
 
*18*)	 Please explain: All the powers within us are not from us. 

The Sun is the source of all our powers. In and of ourselves we are no-one but in and of the Sun we are someone; some of the ONE.

*19*)	 Why does feeling great start with feeling grateful?

Because when we take things for granted we forget our connection to the Sun and lose the joyous appreciation of the miraculous meaning of who we really are. 